src/cf/maERP_ib/src/InformationRegisters/КонтекстныеОбсуждения/КонтекстныеОбсуждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтекстныеОбсуждения</name>
  <resources>
    <name>Адресат</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </resources>
  <resources>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/InformationRegisters/КонтекстныеОбсуждения/ManagerModule.bsl
Процедура ДобавитьСобытие(Владелец, Описание, Адресат = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если Не ЗначениеЗаполнено(Владелец) Тогда Возврат КонецЕсли;
	МЗ = РегистрыСведений.КонтекстныеОбсуждения.СоздатьМенеджерЗаписи();
	МЗ.Владелец = Владелец;
	МЗ.Автор = ПараметрыСеанса.Пользователь;
	МЗ.ДатаСоздания = ТекущаяДатаСеанса();
	МЗ.Отправитель = ?(ПустаяСтрока(МЗ.Автор.ПолноеИмя), СокрЛП(МЗ.Автор), СокрЛП(МЗ.Автор.ПолноеИмя));
	Если ЗначениеЗаполнено(Адресат) Тогда
		МЗ.Адресат = Адресат;
		ПредставлениеАдресата = ?(ПустаяСтрока(МЗ.Адресат.ПолноеИмя), СокрЛП(МЗ.Адресат), СокрЛП(МЗ.Адресат.ПолноеИмя));
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(МЗ.Отправитель, ПредставлениеАдресата, " -> ");
	КонецЕсли;	 
	МЗ.Описание = Описание;
	МЗ.Записать(Истина);
	Если ЗначениеЗаполнено(МЗ.Адресат) Тогда
		РегистрыСведений.СистемныеОповещения.Сформировать(МЗ.Адресат, МЗ.Описание, МЗ.Владелец);
	КонецЕсли;	
КонецПроцедуры

Процедура УдалитьДанные(Владелец) Экспорт
	НЗ = РегистрыСведений.КонтекстныеОбсуждения.СоздатьНаборЗаписей();
	НЗ.Отбор.Владелец.Установить(Владелец);
	НЗ.Записать(Истина);
КонецПроцедуры
